## **Protocol**
통신 시스템이 데이터를 교환하기 위해 사용하는 통신 규칙

## **IP(Internet Protocol)**
*지정한 IP 주소에 패킷으로 데이터 전달
*클라이언트 패킷 전달(출발 IP, 도착IP, 전송 데이터)  -> 서버 -> 서버 패킷 전달(출발 IP, 도착IP, 전송 데이터)

## **IP 프로토콜의 한계**
*비연결성 패킷을 받을 대상이 없거나 서비스 불능 상태여도 패킷 전송
*비신뢰성 패킷 소실 가능성 
	        순서의 문제 ex) 1.Hello 2.world -> 2.world 1.Hello
*프로그램 구분 - 같은 IP를 사용하는 서버에서 통신하는 애플리케이션이 여러 개면 구분 모호

## **인터넷 프로토콜 스택의 4계층**
애플리케이션 계층 - HTTP, FTP
전송 계층 - TCP,UDP
인터넷 계층 - IP
네트워크 인터페이스 계층

***
# TCP(Transmission Control Protocol)

## **TCP 특징**
*연결지향 - TCP 3 way handshake(가상 연결)
*데이터 전달 보증
*순서 보장

신뢰할 수 있는 프로토콜
현재는 대부분 TCP 사용

## **TCP 3 way handshake**
1. SYN 클라 -> 서버
2. SYN+ACK 서버 -> 클라
3. ACK 클라 -> 서버
4. 데이터 전송

SYN : 접속 요청
ACK : 요청 수락

***
# UDP(User Datagram Protocol)

## **UDP 특징**
*기능이 거의 없음(하얀 도화지)
*연결지향 X
*데이터 전달 보증 X
*순서 보장 X
*데이터 전달, 순서 보장되지 않지만 단순하고 빠름

IP와 비슷 +PORT(같은 IP를 사용하는 서버에서 통신하는 애플리케이션이 여러 개일 때 사용해 구분) +체크섬(메시지가 맞는지 검증 해주는 데이터)
TCP는 전송속도 UDP보다 느리고 데이터 양이 많음
최근 UDP가 각광받음(HTTP/3에서 TCP 3 way handshake시간을 줄이기 위해)
